Revit 2027 API
BuiltInFailures.ParameterFailures.InconsistentSharedParameterDefinitions Property
 The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InconsistentSharedParameterDefinitions { get; }
Public Shared ReadOnly Property InconsistentSharedParameterDefinitions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InconsistentSharedParameterDefinitions {
	FailureDefinitionId^ get ();
}
static member InconsistentSharedParameterDefinitions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ParameterFailures Class
Autodesk.Revit.DB Namespace